<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>HasRemovalPasscode</key>
	<false/>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>AllowPreReleaseInstallation</key>
			<false/>
			<key>AutomaticallyInstallAppUpdates</key>
			<false/>
			<key>AutomaticallyInstallMacOSUpdates</key>
			<false/>
			<key>CatalogURL</key>
			<string>http://0.0.0.0</string>
			<key>PayloadDisplayName</key>
			<string>Software Update</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.SoftwareUpdate.b6ba1720-75e4-0139-ec95-2820664fa318</string>
			<key>PayloadType</key>
			<string>com.apple.SoftwareUpdate</string>
			<key>PayloadUUID</key>
			<string>b6ba1720-75e4-0139-ec95-2820664fa318</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>restrict-software-update-require-admin-to-install</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>This will redirect your macOS Update Server into 0.0.0.0, and it won't find any macOS Update anymore after you install this and reboot.  This is quite useful for those who don't want to update their system on purpose.To resume receiving macOS Updates, just simply remove this mobileconfig and reboot.
Please Note: This will also disable App Store Auto Update (You can still update App Store Apps manually)

這會將您電腦的系統更新伺服器指向空值(0.0.0.0)，所以安裝並將電腦重新啟動後不會再收到任何系統更新。這對於某些不想升級的使用者非常有用（不用再三不五時看到更新通知以及紅色點點）。如果要重新接收系統更新，那麼只要移除這個描述檔並重啟即可。
注意：這也將停用App Store App的自動更新（仍然可以手動更新）

Open source on Github
Github開放原始碼
github.com/iambjlu/github.com/iambjlu/NoMoreMacOSUpdate</string>
	<key>PayloadDisplayName</key>
	<string>NoMoreMacOSUpdate</string>
	<key>PayloadIdentifier</key>
	<string>tw.iambjlu.NoMoreMacOSUpdate</string>
	<key>PayloadOrganization</key>
	<string>🥕iambjlu (蘿蔔)</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>7002B514-5C7B-413C-BD35-42AB43600FC7</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
